public class CS
{

    						// 701119-1421722nono
	
    public void bad () {
        
        // 주민번호 테스트 
        String j1 = "7809251324011";  
        String j2 = "780925-1324011";
        String j3 = "780925 1324011";
        long j4 = 7809251324011; 
        
        String j1 = "주민 7809251324011";  
        String j2 = "주민780925-1324011";
        String j3 = "780925 1324011aa";
        String j1 = "주민 7809251324011";  
        String j2 = "주민1780925-1324011 780925-13240112 780925-1324011";
        String j3 = "780925 13240111aa";
        
        //외국인 번호 테스트
        String f1 = "7001015801796";  
        String f2 = "700101-5801796";
        String f3 = "700101 5801796";
        long f4 = 7001015801796; 
        
        // 사업자 번호
        String b1 = "1058675455";  
        String b2 = "105-86-75455";
        String b3 = "105 86 75455";
        long b4 = 1058675455; 
        String b1 = "0000000000"; 
        
        // 볍인번호
        String r1 = "1101110062432";  
        String r2 = "110111-0062432";
        String r3 = "110111 0062432";
        long r4 = 1101110062432; 
        String r1 = "0000000000"; 
    }
	
}